Store/src/Documents/ПоступлениеТовара/ПоступлениеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТовара</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/Documents/ПоступлениеТовара/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Сообщение = "Поменялась цена";

	РассчетСуммы(ТекДанные, Сообщение);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Сообщение = "Поменялось количество";

	РассчетСуммы(ТекДанные, Сообщение);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчетСуммы(Строка, Текст)

	Строка.Сумма = Строка.Количество * Строка.Цена;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

	Человек = ОписаниеСотрудника();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Человек.Имя;
	Сообщение.Сообщить();



КонецПроцедуры

&НаКлиенте
Функция ОписаниеСотрудника()
	Сотрудник = Новый Структура;
	Сотрудник.Вставить("Имя", "Антон");
	Сотрудник.Вставить("Стаж", 15);
	Сотрудник.Вставить("ДатаПриема", ТекущаяДата());
	Сотрудник.Вставить("Штатный", Истина);

	Возврат Сотрудник;

КонецФункции

#КонецОбласти
